lvx/base/Catalogs/бит_ВидыСобытийДоговоров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>бит_ВидыСобытийДоговоров</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Продолжительность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипДней</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_ТипыДнейСобытия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Процент</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидСуммы</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_ВидыСуммСобытийДоговоров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

lvx/base/Catalogs/бит_ВидыСобытийДоговоров/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	
		
	// Вызов механизма защиты
	
	
	// Стандартные действия при создании на сервере.
	бит_РаботаСДиалогамиСервер.ФормаОбъектаПриСозданииНаСервере(Отказ, СтандартнаяОбработка, ЭтотОбъект, Объект);

	Если Отказ Тогда
		Возврат;
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
		
	УправлениеВидимостьюДоступностью();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВидСуммыПриИзменении(Элемент)
	
	УправлениеВидимостьюДоступностью();
		
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Процедура изменяет видимость/доступность элемнтов формы. 
// 
// Параметры:
//  Параметр1 - Строка.
// 
&НаСервере
Процедура УправлениеВидимостьюДоступностью()

	// Вставить содержимое обработчика.
	Если Объект.ВидСуммы = Перечисления.Бит_ВидыСуммСобытийДоговоров.Процент Тогда
		Элементы.Сумма.ТолькоПросмотр = Истина;
		Элементы.Процент.ТолькоПросмотр = Ложь;
		Объект.Сумма = 0;
		
	ИначеЕсли Объект.ВидСуммы = Перечисления.Бит_ВидыСуммСобытийДоговоров.Сумма Тогда
		Элементы.Сумма.ТолькоПросмотр = Ложь;
		Элементы.Процент.ТолькоПросмотр = Истина;
		Объект.Процент = 0;
	КонецЕсли;

КонецПроцедуры // УправлениеВидимостьюДоступностью()

#КонецОбласти
